# SetBearerExtension Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationRodInfo..::..SetBearerExtension Method
FabricationRodInfo Class See Also
---
Sets the bearer extension. The method is applicable only for bearer hanger.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public void SetBearerExtension(
	int rodIndex,
	double length
)
```

Visual Basic
---
```text
Public Sub SetBearerExtension ( _
	rodIndex As Integer, _
	length As Double _
)
```

Visual C++
---
```text
public:
void SetBearerExtension(
	int rodIndex,
	double length
)
```

# ### Parameters
rodIndex
    Type: System..::..Int32 The index of the rod.
length
    Type: System..::..Double The new length of bearer extension.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | the index rodIndex is should be in range of rod count. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The hanger is not a bearer hanger. |

# See Also
FabricationRodInfo Class
Autodesk.Revit.DB Namespace